data_generation/simulation_results/openfoam/case_97/constant/simParams
nIter 2000;
hComponent0 1108.8225475607055;
hComponent1 792.6070588066754;
hComponent2 1292.0837834649737;
hComponent3 1189.7978260082828;
hComponent4 1094.5140583907869;kComponent0 65.26445060659464;
kComponent1 87.70846473091565;
kComponent2 90.1577910661684;
kComponent3 92.86168030406142;
kComponent4 51.81944261822893;
tAmbient 300;
Ux 2.506809171926222;
kPCB 0.6745329679025536;